#include "delay.h"
#include "sys.h"
#include "usart.h"
#include "timer.h"
#include "key.h"

/************************************************************************************************************
编写时间：22.3.25
个人博客：CSDN “老子姓李！”
参考教程链接：https://blog.csdn.net/qq_44078824/article/details/123753825
本程序只供学习使用，未经作者许可，不得用于其它任何用途
实验器材:
	自制开发板，STM32F03C8T6平台
	
实验目的:
	学习定时器中断、按键使用。实现单击双击操作
	
硬件资源:
	按键(PA0,也称之为WK_UP)
	定时器3
	串口1，用于打印输出
	
实验现象:
	按时间小于1s后释放，触发单击事件，串口打印"单击"
	按时间大于1s后释放，触发长按事件，串口打印"长按"	
************************************************************************************************************/

int main(void)
{	

	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	uart_init(115200); // 用于查看输出
	TIM3_Int_Init(200-1,7200-1); //调用定时器使得20ms产生一个中断
	//按键初始化函数
	KEY_Init();
	
	while(1);

}     




